SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
#include "stm32f10x.h"
#include "stm32f10x_can.h"
#include "Delay.h"
#include "YbImu.h"
#include <math.h>

/*==========================================================================
 * 两驱差速小车 —— STM32 底盘板
 *
 *   USART1  PA9(TX) / PA10(RX)  <->  主上位机 CH340 / RK3588   115200 8N-1
 *   USART2  PA2(TX) / PA3(RX)   <->  调试用 ESP32              115200 8N-1
 *   CAN1    PA12(TX)/ PA11(RX)  -->  两台 FOC 驱动器            500 kbps 扩展帧
 *
 * 两个串口跑**同一套协议**，谁最近发了非零命令谁就拿到控制权，
 * 主口(USART1)优先级更高，可以随时抢占。详见下面"控制权仲裁"。
 *
 * STM32 负责:
 *   1. 解析上位机发来的车体目标速度 (vx, vy, wz)
 *   2. 差速逆解 -> 左右轮目标转速 -> CAN 下发
 *   3. 轮速正解 -> 车体速度, 按协议上报
 *   4. 看门狗: 当前控制方静默 800ms 就自动停车
 *   5. (可选) 本地扩展卡尔曼滤波, 见 EKF_ON_STM32
 *
 * ---------------------------------------------------------------------------
 * 协议沿用 Wheeltec 底盘那套 (见 chassis_serial_control.md)
 *
 * 【命令帧 11 字节  上位机 -> STM32】
 *   [0]    0x7B          帧头
 *   [1]    AutoRecharge  正常走车 = 0
 *   [2]    SecurityPLY   正常走车 = 0
 *   [3-4]  int16 BE      vx * 1000   mm/s
 *   [5-6]  int16 BE      vy * 1000   mm/s    (差速车忽略)
 *   [7-8]  int16 BE      wz * 1000   mrad/s
 *   [9]    BCC = XOR([0..8])
 *   [10]   0x7D          帧尾
 *
 * 【主遥测帧 24 字节  STM32 -> 上位机】  (完全按协议标准, 两个口都发)
 *   [0]    0x7B
 *   [1]    Flag_Stop
 *   [2-3]  int16 BE 车体 vx   mm/s
 *   [4-5]  int16 BE 车体 vy   mm/s
 *   [6-7]  int16 BE 车体 wz   mrad/s
 *   [8-9]  int16 BE IMU ax 原始值
 *   [10-11]        ay
 *   [12-13]        az
 *   [14-15]        gx
 *   [16-17]        gy
 *   [18-19]        gz
 *   [20-21] uint16 BE 电池电压 mV
 *   [22]   BCC = XOR([0..21])
 *   [23]   0x7D
 *
 * 【里程计帧 34 字节  STM32 -> 上位机】  (本工程扩展, 头 0x7E)
 *   厂商驱动不认识这一帧, 默认只发给调试口(ESP32), 见 ODOM_FRAME_TO_MAIN。
 *   [0]    0x7E
 *   [1]    flags  bit0 里程计已收敛  bit1 看门狗停车  bit2 曾收到命令
 *   [2-5]  int32 BE x   mm
 *   [6-9]  int32 BE y   mm
 *   [10-11] int16 BE 航向角  单位 0.01 度
 *   [12-13] int16 BE 滤波后 vx   mm/s
 *   [14-15] int16 BE 滤波后 wz   mrad/s
 *   [16-17] int16 BE 左轮物理转速 RPM
 *   [18-19] int16 BE 右轮物理转速 RPM
 *   [20-21] int16 BE 左轮目标 RPM
 *   [22-23] int16 BE 右轮目标 RPM
 *   [24]   1号驱动器故障码
 *   [25]   2号驱动器故障码
 *   [26]   CAN 发送错误计数
 *   [27]   UART 坏帧计数
 *   [28]   UART 有效命令计数
 *   [29]   UART 溢出计数
 *   [30]   继电器状态  bit0 电机 bit1 水泵
 *   [31]   当前控制方  0=无 1=主口(CH340/RK3588) 2=从口(ESP32)
 *   [32]   IMU 诊断码  0=正常 1=SCL拉不高 2=SDA拉不高 3=总线死 4=无应答 5=读出错
 *   [33]   IMU 扫描到的 I2C 地址 (0 = 没扫到)
 *   [34]   BCC = XOR([0..33])
 *   [35]   0x7D
 *========================================================================*/

/*========================= 想改的地方 =========================*/
#define WHEEL_DIAMETER_MM   205.0f  /* 车轮直径 mm */
#define TRACK_WIDTH_MM      930.0f  /* 左右轮触地间距 mm */

#define MAX_RPM             200     /* 单轮转速上限 */
#define MAX_YAW_RATE        3.0f    /* 车体角速度限幅 rad/s */

#define MOTOR1_IS_LEFT         1    /* 1=1号电机在左侧; 若左右反了改成 0 */
#define MOTOR1_INVERT          0    /* 某个轮子转向相反时改成 1 */
#define MOTOR2_INVERT          1    /* 实测2号电机正方向是反的 */

/*---------------------- 待机时的电机状态 ----------------------------
 *   没有命令(或收到零速度)时、以及断链看门狗触发时, 一律发 STOP_CTRL。
 *   想换待机手感只改这一个宏:
 *     CTRL_BRAKE (03)   动态制动, 相线短接。转速越低制动力越小 -> 慢慢推很轻
 *     CTRL_DISABLE(02)  完全松开, 轮子自由滑行
 *     CTRL_ENABLE(01)+0 速度环有静区: 不推时误差0、输出0 -> 慢慢推也不出力
 *
 *   历史教训: 这里曾经做过"位置模式锁位"(先刹停 -> 切 MODE_POSITION ->
 *   死守驱动器回码里的 m1_pos/m2_pos)。它会把驱动器切出速度模式, 再靠一路
 *   陈旧的绝对位置目标维持, 平白多出"模式切换"和"位置目标"两个变量 ——
 *   实测在车上出现了失控。已删除。
 *   现在的停车路径是**无状态**的: 每个控制周期重发同一条帧, 不记忆、不切换。
 *-----------------------------------------------------------------*/
#define STOP_CTRL           CTRL_BRAKE

/*---------------------- 双串口 / 控制权 ----------------------------
 *   PORT_MAIN (USART1, PA9/PA10) -> CH340 / RK3588   主口, 可以抢占
 *   PORT_AUX  (USART2, PA2/PA3)  -> 调试用 ESP32     从口, 主口空闲时才能拿
 *
 *   OWNER_TIMEOUT_MS: 控制方多久不发命令就释放控制权(让另一个口能接管)。
 *                     必须比 LINK_TIMEOUT_MS 短, 否则交接时车会先被看门狗刹停。
 *   LINK_TIMEOUT_MS : 当前控制方多久不发命令就自动停车(看门狗)。
 *-----------------------------------------------------------------*/
#define MAIN_BAUD           115200  /* 对齐厂商驱动, 别改 */
#define AUX_BAUD            115200  /* ESP32 那个口, 想提速可以改 */
#define OWNER_TIMEOUT_MS    500
#define LINK_TIMEOUT_MS     800

/*======================= 构建模式 (两个 Keil 工程共用这份源码) ==========
 *   CHASSIS_RK3588_ONLY = 1   生产版
 *       只认主口 USART1(PA9/PA10, 接 RK3588)的命令, 和 ESP32 完全脱钩:
 *         - 根本不初始化 USART2, PA2/PA3 空着
 *         - 不做控制权仲裁 (只有一个上位机, 没有仲裁的必要)
 *         - 不跑本地卡尔曼, 不发 0x7E 扩展帧 (EKF 在上位机 RK3588 上做)
 *       省下来的时间: 遥测从 84 字节降到 24 字节, 每 50ms 少阻塞约 5ms,
 *       控制周期更紧; 也少 36 字节扩展帧去干扰厂商驱动。
 *
 *   CHASSIS_RK3588_ONLY = 0   调试版
 *       双串口 + 控制权仲裁 + 本地 EKF + 0x7E 位姿帧, 配合 ESP32 网页遥控。
 *
 * 两个 .uvprojx 各定义一个, 源码只有一份 —— 修 bug 只修一处。
 *=====================================================================*/
#ifndef CHASSIS_RK3588_ONLY
#define CHASSIS_RK3588_ONLY 0
#endif

/*---------------------- 本地卡尔曼(可选) ---------------------------
 *   生产版强制关闭: EKF 在 RK3588 上做, STM32 只负责按协议报车体速度。
 *   调试版打开: 网页能画轨迹。
 *-----------------------------------------------------------------*/
#if CHASSIS_RK3588_ONLY
#define EKF_ON_STM32        0
#define ODOM_FRAME_TO_MAIN  0
#else
#define EKF_ON_STM32        1
#define ODOM_FRAME_TO_MAIN  0   /* 位姿帧是本工程扩展, 厂商驱动不认识, 默认只发调试口 */
#endif

/*---------------------- GPIO 继电器 (外设开关) ----------------------
 *   PB0 -> 电机继电器 IN     PB1 -> 水泵继电器 IN
 *
 *   ★ 接线铁律: 模块的 VCC/GND 一定要和 STM32 共用同一个电源参考，
 *     最省事的做法就是直接从本板引 5V 和 GND。
 *     曾经用独立 5V 供电(没共地)时，光耦输入回路没有稳定的返回路径，
 *     驱动电流时有时无 -> 光耦半开 -> 线圈半通电 -> 继电器持续嗡嗡响。
 *     改成从本板取 5V/GND 后立刻正常。线也要短、要粗。
 *
 *   触发电平(本车实测): 模块是低电平触发，所以下面用 1。
 *     IN 给低 -> 继电器吸合(负载通电)      IN 给高 -> 断开
 *   换模块后如果网页上"开/关"反了，把这个值改成 0 即可。
 *   模块上如果有 H/L 跳线，拨到 L。
 *
 *   RELAY_OFF_ON_LINK_LOSS: 链路断了(看门狗)自动断开两个继电器。
 *-----------------------------------------------------------------*/
#define RELAY_MOTOR_PIN     GPIO_Pin_0      /* PB0 */
#define RELAY_PUMP_PIN      GPIO_Pin_1      /* PB1 */
#define RELAY_PORT          GPIOB
#define RELAY_ACTIVE_LOW    1               /* 1=低电平触发(实测) 0=高电平触发 */
#define RELAY_OFF_ON_LINK_LOSS  1
/*=============================================================*/

/*-------------------------- 物理换算 ------------------------------*/
#define WHEEL_CIRC_M        (3.14159265f * WHEEL_DIAMETER_MM / 1000.0f)  /* 0.64403 m */
#define TRACK_WIDTH_M       (TRACK_WIDTH_MM / 1000.0f)                   /* 0.930 m */
#define MAX_LIN_SPEED       (MAX_RPM * WHEEL_CIRC_M / 60.0f)             /* 2.147 m/s */

