SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
static void Relay_Init(void)
{
    GPIO_InitTypeDef gpio;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

    gpio.GPIO_Pin = RELAY_MOTOR_PIN | RELAY_PUMP_PIN;
    gpio.GPIO_Mode = GPIO_Mode_Out_PP;
    gpio.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(RELAY_PORT, &gpio);

    Relay_Set(0);       /* 上电先全部断开, 不要一通电就抽水 */
}

/*======================== 命令帧 (11字节) ==========================
 * 帧头 + 定长 + 帧尾 + BCC。校验失败时整体左移一字节重新同步,
 * 这样即使中间丢了字节也能自己找回来。
 *=================================================================*/
static float ClampF(float v, float lo, float hi)
{
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
}

static uint8_t Cmd_Verify(const uint8_t *f)
{
    uint8_t i;
    uint8_t bcc = 0;

    if (f[0] != CMD_HEAD) return 0;
    if (f[CMD_FRAME_SIZE - 1] != TEL_TAIL) return 0;
    for (i = 0; i < CMD_FRAME_SIZE - 2; i++)
    {
        bcc ^= f[i];
    }
    return (bcc == f[CMD_FRAME_SIZE - 2]);
}

/*==================== 控制权仲裁 (两个串口共用一个底盘) =============
 * 问题: 主口(RK3588)和从口(ESP32)都能发速度帧, 谁说了算?
 *   - 主口是长期上位机, 优先级高
 *   - 从口是调试用的, 主口不在的时候才能接管
 *
 * 规则:
 *   1. 只有"非零"速度帧才claim控制权(零速度是停车/心跳, 不抢)
 *   2. 主口随时可以抢; 从口只能在"主口不是控制方"或"主口控制权已超时"时拿
 *   3. 控制权 500ms 不刷新就释放(OWNER_TIMEOUT_MS)
 *   4. 不是控制方的速度帧直接丢弃
 *   5. 看门狗只认控制方的帧 —— 否则从口的心跳会把看门狗一直喂着,
 *      主口掉线了车也不会停, 这是会出事的
 *   6. 继电器是"锁存式开关", 两个口都随时可操作, 不参与仲裁
 *=================================================================*/
static void Cmd_Apply(uint8_t port_id, const uint8_t *f)
{
    int16_t vx_mm;
    int16_t wz_mrad;
    uint8_t nonzero;

    /* ---- 功能帧: f[1] 是功能码, 不是速度帧 ---- */
    if (f[1] == FUNC_RELAY)
    {
        Relay_Set(f[2]);            /* f[2] = 掩码 bit0 电机 bit1 水泵 */
        if (ports[port_id].ok_count != 0xFF) ports[port_id].ok_count++;
        return;
    }

    /* ---- 协议里的其它功能帧: 本工程没实现, 必须忽略 ----
     * 这些帧和速度帧同为 11 字节、同头同尾, 靠 f[1]/f[2] 区分
     * (docs/chassis-serial-protocol.md 第 6 节):
     *     f[1]=0x04             灯带       f[2]=EN, f[3..5]=RGB
     *     f[1]=1, f[2]=0xA0/0xA1 回充开关
     *     f[1]=0, f[2]=0xB0/0xB1 底盘安全防护
     * ★ 绝对不能当速度帧解析 —— 那样 f[3..8] 会被误读成 vx/wz, 车会乱窜。
     *   正常速度帧的 f[1] 只可能是 AutoRecharge(0/1), 所以 f[1]>1 一律不是速度帧。
     */
    if ((f[1] > 1) ||
        ((f[1] == 1) && ((f[2] == 0xA0) || (f[2] == 0xA1))) ||
        ((f[1] == 0) && ((f[2] == 0xB0) || (f[2] == 0xB1))))
    {
        if (ports[port_id].ok_count != 0xFF) ports[port_id].ok_count++;
        return;
    }

    /* ---- 速度帧 ---- */
    /* f[1]=AutoRecharge  f[2]=SecurityPLY  f[5..6]=vy (差速车忽略) */
    vx_mm = (int16_t)(((uint16_t)f[3] << 8) | f[4]);
    wz_mrad = (int16_t)(((uint16_t)f[7] << 8) | f[8]);
    nonzero = (uint8_t)((vx_mm != 0) || (wz_mrad != 0));
    if (ports[port_id].ok_count != 0xFF) ports[port_id].ok_count++;

#if CHASSIS_RK3588_ONLY
    /* 生产版: 只有 RK3588 一个上位机, 不需要仲裁。
       理论上从口根本不会被初始化, 这里再挡一道, 免得以后手滑接上 ESP32。 */
    (void)nonzero;
    if (port_id != PORT_MAIN)
    {
        return;
    }
#else
    /* ---- 抢占 / 续期 ---- */
    if (nonzero)
    {
        if (port_id == PORT_MAIN)
        {
            ctrl_owner = PORT_MAIN;                 /* 主口随时可抢 */
            ctrl_owner_ms = g_tick_ms;
        }
        else if ((ctrl_owner != PORT_MAIN) ||
                 ((g_tick_ms - ctrl_owner_ms) > OWNER_TIMEOUT_MS))
        {
            ctrl_owner = PORT_AUX;                  /* 从口只能捡主口不要的 */
            ctrl_owner_ms = g_tick_ms;
        }
    }
    else if (ctrl_owner == port_id)
    {
        ctrl_owner_ms = g_tick_ms;                  /* 控制方发零速, 续期 */
    }

    /* ---- 不是控制方就丢弃 ---- */
    if (ctrl_owner != port_id)
    {
        return;
    }
#endif

    target_vx = ClampF((float)vx_mm / 1000.0f, -MAX_LIN_SPEED, MAX_LIN_SPEED);
    target_wz = ClampF((float)wz_mrad / 1000.0f, -MAX_YAW_RATE, MAX_YAW_RATE);

    last_cmd_ms = g_tick_ms;
    ever_linked = 1;
    failsafe_latched = 0;
}

static void Port_Feed(uart_port_t *p, uint8_t value)
{
    uint8_t i;

    if (p->len >= CMD_FRAME_SIZE)
    {
        /* 上一帧没通过校验, 左移一字节用滑动窗口重新找帧头 */
        for (i = 1; i < CMD_FRAME_SIZE; i++)
        {
            p->frame[i - 1] = p->frame[i];
        }
        p->len = CMD_FRAME_SIZE - 1;
    }

    p->frame[p->len++] = value;

    if (p->len == CMD_FRAME_SIZE)
    {
        if (Cmd_Verify(p->frame))
        {
            Cmd_Apply(p->id, p->frame);
            p->len = 0;
        }
        else if (p->bad_count != 0xFF)
        {
            p->bad_count++;
        }
        /* 校验失败时保留数据, 下次进来左移重试 */
    }
}

static void Port_ProcessCommands(uart_port_t *p)
{
    while (p->tail != p->head)
    {
        uint8_t value = p->ring[p->tail];
        p->tail = (uint8_t)((p->tail + 1) & 0x3F);
        Port_Feed(p, value);
    }
}

/*========================= 轮速计 ==================================
 * 把两个电机的实际转速按接线校准成"左轮/右轮物理转速",
 * 再正解出车体速度 (vx, wz) 供上报。
 *=================================================================*/
static void Wheel_Update(void)
{
    int16_t a = m1_rpm;
    int16_t b = m2_rpm;
    float v_left;
    float v_right;

    /* 驱动器掉线时实际转速会一直停在最后一个值, 必须当成 0, 否则会飘 */
    if ((g_tick_ms - m1_rpm_ms) > RPM_STALE_MS) a = 0;
    if ((g_tick_ms - m2_rpm_ms) > RPM_STALE_MS) b = 0;

    /* 驱动器报的是"命令方向"上的转速, 按安装校准换算成物理方向 */
    if (MOTOR1_INVERT) a = (int16_t)(-a);
    if (MOTOR2_INVERT) b = (int16_t)(-b);

    if (MOTOR1_IS_LEFT)
    {
        wheel_left_rpm = a;
        wheel_right_rpm = b;
    }
    else
    {
        wheel_left_rpm = b;
        wheel_right_rpm = a;
    }

    /* 正向运动学: 左右轮线速度 -> 车体速度 (协议里上报的就是这个) */
    v_left  = (float)wheel_left_rpm  * WHEEL_CIRC_M / 60.0f;
    v_right = (float)wheel_right_rpm * WHEEL_CIRC_M / 60.0f;
    body_vx = (v_left + v_right) * 0.5f;
    body_wz = (v_right - v_left) / TRACK_WIDTH_M;
}

/*========================= 差速逆解 ================================
 * 车体 (vx, wz) -> 左右轮目标转速。差速车用不到 vy。
 *   v_left  = vx - wz * b/2
 *   v_right = vx + wz * b/2
 *=================================================================*/
static void Drive_Apply(void)
{
    float v_left = target_vx - target_wz * (TRACK_WIDTH_M * 0.5f);
    float v_right = target_vx + target_wz * (TRACK_WIDTH_M * 0.5f);
    float rpm_l = v_left / WHEEL_CIRC_M * 60.0f;
    float rpm_r = v_right / WHEEL_CIRC_M * 60.0f;
    int16_t m1;
    int16_t m2;

