SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
    rpm_l = ClampF(rpm_l, -(float)MAX_RPM, (float)MAX_RPM);
    rpm_r = ClampF(rpm_r, -(float)MAX_RPM, (float)MAX_RPM);

    /* 物理轮速 -> CAN 命令 (反向应用接线校准) */
    if (MOTOR1_IS_LEFT) { m1 = (int16_t)rpm_l; m2 = (int16_t)rpm_r; }
    else                { m1 = (int16_t)rpm_r; m2 = (int16_t)rpm_l; }
    if (MOTOR1_INVERT) m1 = (int16_t)(-m1);
    if (MOTOR2_INVERT) m2 = (int16_t)(-m2);

#if EKF_ON_STM32
    target_left_rpm = (int16_t)rpm_l;      /* 上报给上位机的是物理轮速目标, */
    target_right_rpm = (int16_t)rpm_r;     /* 不是电机命令, 免得左右概念混淆 */
#endif

    /*===================== 走 / 停 两态 =====================
     * 停车就是一条 STOP_CTRL 帧, 每个控制周期重发。
     * 不切模式、不记忆状态、不引用位置 —— 出问题只可能出在电机或接线,
     * 不可能出在这几行逻辑上。这是上一版"位置锁位"失控后刻意保留的简单。
     *=======================================================*/
    if ((m1 != 0) || (m2 != 0))
    {
        CAN1_SendSpeed(MOTOR1_CAN_ID, m1);
        CAN1_SendSpeed(MOTOR2_CAN_ID, m2);
    }
    else
    {
        CAN1_SendStop(MOTOR1_CAN_ID);
        CAN1_SendStop(MOTOR2_CAN_ID);
    }
}

/*==================================================================
 *  扩展卡尔曼滤波
 *
 *  状态 x = [ X, Y, theta, v, wz, bgz ]
 *      X,Y    位置 m
 *      theta  航向 rad, 逆时针为正, 0 指向 +X
 *      v      车体线速度 m/s
 *      wz     车体角速度 rad/s
 *      bgz    陀螺仪 Z 轴零偏 rad/s   (现在没用上, IMU 来了就生效)
 *
 *  预测:  用当前 v, wz 推位姿
 *  观测1: 轮速计算出的 (v, wz)          —— 一直有
 *  观测2: 陀螺仪 Z 轴角速度 gz = wz + bgz —— 接了 IMU 才有
 *
 *  生产版 (CHASSIS_RK3588_ONLY=1) 整块编译掉: EKF 在上位机 RK3588 上做。
 *==================================================================*/
#if EKF_ON_STM32
#define EKF_N 6

static float ekf_x[EKF_N];
static float ekf_P[EKF_N][EKF_N];
static uint8_t ekf_ready;

static float WrapPi(float a)
{
    while (a >  3.14159265f) a -= 6.28318531f;
    while (a < -3.14159265f) a += 6.28318531f;
    return a;
}

static void Ekf_Symmetrize(void)
{
    uint8_t i, j;
    for (i = 0; i < EKF_N; i++)
    {
        for (j = (uint8_t)(i + 1); j < EKF_N; j++)
        {
            float s = 0.5f * (ekf_P[i][j] + ekf_P[j][i]);
            ekf_P[i][j] = s;
            ekf_P[j][i] = s;
        }
        if (ekf_P[i][i] < 1e-9f) ekf_P[i][i] = 1e-9f;
    }
}

static void Ekf_Init(void)
{
    uint8_t i, j;

    for (i = 0; i < EKF_N; i++)
    {
        ekf_x[i] = 0.0f;
        for (j = 0; j < EKF_N; j++)
        {
            ekf_P[i][j] = (i == j) ? 0.01f : 0.0f;
        }
    }
    ekf_ready = 1;
}

static void Ekf_Predict(float dt)
{
    float F[EKF_N][EKF_N];
    float FP[EKF_N][EKF_N];
    float FPFt[EKF_N][EKF_N];
    float v = ekf_x[3];
    float w = ekf_x[4];
    float theta_mid = ekf_x[2] + w * dt * 0.5f;
    float c = cosf(theta_mid);
    float s = sinf(theta_mid);
    float ds = fabsf(v) * dt;
    float dth = fabsf(w) * dt;
    float q_pos, q_th, q_v, q_w, q_b;
    float sum;
    uint8_t i, j, k;

    /* --- 状态传播 --- */
    ekf_x[0] += v * c * dt;
    ekf_x[1] += v * s * dt;
    ekf_x[2] = WrapPi(ekf_x[2] + w * dt);

    /* --- 状态转移雅可比 F = I + 偏置 --- */
    for (i = 0; i < EKF_N; i++)
    {
        for (j = 0; j < EKF_N; j++)
        {
            F[i][j] = (i == j) ? 1.0f : 0.0f;
        }
    }
    F[0][2] = -v * s * dt;
    F[0][3] =  c * dt;
    F[0][4] = -v * s * dt * dt * 0.5f;
    F[1][2] =  v * c * dt;
    F[1][3] =  s * dt;
    F[1][4] =  v * c * dt * dt * 0.5f;
    F[2][4] =  dt;

    /* --- P = F P F' + Q --- */
    for (i = 0; i < EKF_N; i++)
    {
        for (j = 0; j < EKF_N; j++)
        {
            sum = 0.0f;
            for (k = 0; k < EKF_N; k++) sum += F[i][k] * ekf_P[k][j];
            FP[i][j] = sum;
        }
    }
    for (i = 0; i < EKF_N; i++)
    {
        for (j = 0; j < EKF_N; j++)
        {
            sum = 0.0f;
            for (k = 0; k < EKF_N; k++) sum += FP[i][k] * F[j][k];   /* F[j][k] = F'[k][j] */
            FPFt[i][j] = sum;
        }
    }

    /* 过程噪声: 走得越远/转得越多, 位置和航向越不确定 */
    q_pos = EKF_SLIP_DIST * ds + 0.0005f;  q_pos *= q_pos;
    q_th  = EKF_SLIP_ANG  * dth + 0.001f;  q_th  *= q_th;
    q_v   = EKF_ACCEL_NOISE * dt;          q_v   *= q_v;
    q_w   = EKF_ANGACC_NOISE * dt;         q_w   *= q_w;
    q_b   = EKF_BIAS_WALK * dt;            q_b   *= q_b;

    for (i = 0; i < EKF_N; i++)
    {
        for (j = 0; j < EKF_N; j++)
        {
            ekf_P[i][j] = FPFt[i][j];
        }
    }
    ekf_P[0][0] += q_pos;
    ekf_P[1][1] += q_pos;
    ekf_P[2][2] += q_th;
    ekf_P[3][3] += q_v;
    ekf_P[4][4] += q_w;
    ekf_P[5][5] += q_b;

    Ekf_Symmetrize();
}

/* 观测: 轮速计解算出的车体 (v, wz) */
static void Ekf_UpdateWheel(float v_meas, float w_meas)
{
    float S00, S01, S10, S11, det, inv00, inv01, inv10, inv11;
    float K[EKF_N][2];
    float y0 = v_meas - ekf_x[3];
    float y1 = w_meas - ekf_x[4];
    float row3[EKF_N];
    float row4[EKF_N];
    uint8_t i, j;

    S00 = ekf_P[3][3] + EKF_SIGMA_V * EKF_SIGMA_V;
    S01 = ekf_P[3][4];
    S10 = ekf_P[4][3];
    S11 = ekf_P[4][4] + EKF_SIGMA_W * EKF_SIGMA_W;

    det = S00 * S11 - S01 * S10;
    if (fabsf(det) < 1e-12f) return;

    inv00 =  S11 / det;
    inv01 = -S01 / det;
    inv10 = -S10 / det;
    inv11 =  S00 / det;

    /* K = P H' S^-1 ;  H 选中第 3、4 个状态, 所以 P H' 的两列就是 P 的第 3、4 列 */
    for (i = 0; i < EKF_N; i++)
    {
        float a = ekf_P[i][3];
        float b = ekf_P[i][4];
        K[i][0] = a * inv00 + b * inv10;
        K[i][1] = a * inv01 + b * inv11;
    }

    for (i = 0; i < EKF_N; i++)
    {
        ekf_x[i] += K[i][0] * y0 + K[i][1] * y1;
    }
    ekf_x[2] = WrapPi(ekf_x[2]);

    /* P = (I - K H) P ;  先把要用的两行拷出来, 否则原地更新会串味 */
    for (j = 0; j < EKF_N; j++)
    {
        row3[j] = ekf_P[3][j];
        row4[j] = ekf_P[4][j];
    }
    for (i = 0; i < EKF_N; i++)
    {
        for (j = 0; j < EKF_N; j++)
        {
            ekf_P[i][j] -= K[i][0] * row3[j] + K[i][1] * row4[j];
        }
    }

    Ekf_Symmetrize();
}

/* 观测: 陀螺仪 Z 轴角速度, 同时估计零偏 */
static void Ekf_UpdateGyro(float gz)
{
    float S;
    float K[EKF_N];
    float y = gz - (ekf_x[4] + ekf_x[5]);
    float row4[EKF_N];
    float row5[EKF_N];
    uint8_t i, j;

    S = ekf_P[4][4] + ekf_P[4][5] + ekf_P[5][4] + ekf_P[5][5] + EKF_SIGMA_GZ * EKF_SIGMA_GZ;
    if (S < 1e-12f) return;

