SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
    for (i = 0; i < EKF_N; i++)
    {
        K[i] = (ekf_P[i][4] + ekf_P[i][5]) / S;
    }
    for (i = 0; i < EKF_N; i++)
    {
        ekf_x[i] += K[i] * y;
    }
    ekf_x[2] = WrapPi(ekf_x[2]);

    for (j = 0; j < EKF_N; j++)
    {
        row4[j] = ekf_P[4][j];
        row5[j] = ekf_P[5][j];
    }
    for (i = 0; i < EKF_N; i++)
    {
        for (j = 0; j < EKF_N; j++)
        {
            ekf_P[i][j] -= K[i] * (row4[j] + row5[j]);
        }
    }

    Ekf_Symmetrize();
}

/*======================= IMU 陀螺仪接口 (给本地 EKF 用) =============
 * 本地卡尔曼只要陀螺仪 Z 轴角速度(rad/s, 逆时针为正)。
 * 这里返回缓存值, 真正去读 I2C 的是 IMU_Tick()。
 *
 * ★ 车体逆时针为正, 但 IMU 装反了/坐标系不同的话符号可能相反 ——
 *   症状是轮速和陀螺仪互相打架, 航向估计反而更差。这时候改
 *   IMU_GYRO_Z_SIGN 为 -1。
 *
 * 返回 0 表示这次没有可信的陀螺仪数据, EKF 会自动跳过这一步。
 *=================================================================*/
static uint8_t IMU_ReadGyroZ(float *gz)
{
    if (!imu_gyro_ok)
    {
        return 0;
    }
    *gz = imu_gyro[2] * (float)IMU_GYRO_Z_SIGN;
    return 1;
}

#endif /* EKF_ON_STM32 */

/*======================= IMU (YbImu) ==============================
 * 按 ODOM_PERIOD_MS 采一次。读失败不清零 —— 保留上一次的值。
 *
 * 调试版还会记录一串诊断状态, 读失败时最多每秒做一次总线检查 + 地址扫描,
 * 结果通过 0x7E 帧报给网页 —— 否则"读取失败"这四个字什么信息都没有。
 * 生产版没有地方上报这些东西, 整块编译掉, 顺便省掉扫描的开销。
 *=================================================================*/
#if EKF_ON_STM32
#define IMU_DIAG_PERIOD_MS  1000
#endif

static void IMU_Tick(void)
{
    float accel[3];
    float gyro[3];
    uint8_t err;

    err = YbImu_ReadMotion(accel, gyro);

    /* YBIMU_ST_GYRO_ZERO 表示加速度读到了但陀螺仪恒为 0 —— 加速度还是能用的,
       所以不算完全失败。 */
    if ((err == YBIMU_ST_OK) || (err == YBIMU_ST_GYRO_ZERO))
    {
        imu_accel_g[0] = accel[0];
        imu_accel_g[1] = accel[1];
        imu_accel_g[2] = accel[2];

        if (err == YBIMU_ST_OK)
        {
            imu_gyro[0] = gyro[0];
            imu_gyro[1] = gyro[1];
            imu_gyro[2] = gyro[2];
        }
        else
        {
            imu_gyro[0] = 0.0f;
            imu_gyro[1] = 0.0f;
            imu_gyro[2] = 0.0f;
        }

#if EKF_ON_STM32
        imu_ok = 1;
        imu_gyro_ok = (uint8_t)(err == YBIMU_ST_OK);
        imu_status = err;
        imu_found_addr = YBIMU_I2C_ADDR;
#endif
        return;
    }

#if EKF_ON_STM32
    imu_ok = 0;
    imu_gyro_ok = 0;
    imu_status = err;

    /* 失败了才诊断, 而且不要每次都跑(扫描很慢) */
    if ((g_tick_ms - imu_diag_ms) >= IMU_DIAG_PERIOD_MS)
    {
        uint8_t bus = YbImu_BusCheck();
        imu_diag_ms = g_tick_ms;

        if (bus != YBIMU_ST_OK)
        {
            imu_status = bus;               /* 总线本身就不对 */
            imu_found_addr = 0;
        }
        else
        {
            imu_found_addr = YbImu_Scan();  /* 总线是好的, 那就是地址/器件问题 */
            imu_status = (imu_found_addr == 0) ? YBIMU_ST_NO_ACK : YBIMU_ST_READ_ERR;
        }
    }
#endif
}

/* 物理量 -> 协议规定的 ±2g / ±500dps 原始值, 带限幅(超量程夹住而不是回绕) */
static int16_t IMU_AccelToRaw(float accel_g)
{
    float v = accel_g * IMU_ACCEL_G_TO_RAW;

    if (v >  32767.0f) v =  32767.0f;
    if (v < -32768.0f) v = -32768.0f;
    return (int16_t)v;
}

static int16_t IMU_GyroToRaw(float gyro_rad_s)
{
    float v = gyro_rad_s * IMU_GYRO_TO_RAW;

    if (v >  32767.0f) v =  32767.0f;
    if (v < -32768.0f) v = -32768.0f;
    return (int16_t)v;
}

/*======================= 轮速采样 + (可选)滤波 ===================*/
static void Odom_Tick(void)
{
    Wheel_Update();
    IMU_Tick();     /* 位翻转 I2C 读 IMU, 大约 1~3ms */

#if EKF_ON_STM32
    {
        const float dt = (float)ODOM_PERIOD_MS / 1000.0f;
        float gz;

        Ekf_Predict(dt);
        Ekf_UpdateWheel(body_vx, body_wz);
        if (IMU_ReadGyroZ(&gz))
        {
            Ekf_UpdateGyro(gz);
        }
    }
#endif
}

/*=========================== 状态回传 ==============================
 * 主遥测帧严格按协议 24 字节; 位姿放在扩展的里程计帧里(头 0x7E)。
 *=================================================================*/
static void Send_MainTelemetry(uart_port_t *p)
{
    uint8_t f[TEL_FRAME_SIZE];
    uint8_t i;
    uint8_t bcc = 0;
    int16_t vx_mm = (int16_t)(body_vx * 1000.0f);       /* 轮速正解出的车体速度 */
    int16_t vy_mm = 0;                                  /* 差速车没有横向速度 */
    int16_t wz_mrad = (int16_t)(body_wz * 1000.0f);

    f[0] = TEL_HEAD;
    f[1] = (target_vx == 0.0f && target_wz == 0.0f) ? 1 : 0;   /* Flag_Stop */
    PutI16(&f[2], vx_mm);
    PutI16(&f[4], vy_mm);
    PutI16(&f[6], wz_mrad);
    /* IMU 六轴原始值。
       ★ 必须是 ±2g / ±500dps 量程下的值 —— 上位机是按固定系数换算的
         (MD 5.1 节): 加速度 /1671.84 = m/s², 角速度 ×0.00026644 = rad/s。
         YbImu 本身是 ±16g / ±2000dps, 已经在 IMU_AccelToRaw/GyroToRaw 里换算了。
       读失败时保留上一次的值(不清零), 上位机看 flags 的 bit3 判断是否可信。 */
    PutI16(&f[8],  IMU_AccelToRaw(imu_accel_g[0]));   /* ax */
    PutI16(&f[10], IMU_AccelToRaw(imu_accel_g[1]));   /* ay */
    PutI16(&f[12], IMU_AccelToRaw(imu_accel_g[2]));   /* az */
    PutI16(&f[14], IMU_GyroToRaw(imu_gyro[0]));       /* gx */
    PutI16(&f[16], IMU_GyroToRaw(imu_gyro[1]));       /* gy */
    PutI16(&f[18], IMU_GyroToRaw(imu_gyro[2]));       /* gz */
    PutU16(&f[20], battery_mv);
    for (i = 0; i < TEL_FRAME_SIZE - 2; i++) bcc ^= f[i];
    f[TEL_FRAME_SIZE - 2] = bcc;
    f[TEL_FRAME_SIZE - 1] = TEL_TAIL;

    for (i = 0; i < TEL_FRAME_SIZE; i++) Port_SendByte(p, f[i]);
}

/* 位姿扩展帧 (0x7E) —— 本工程自定义, 厂商驱动不认识。
   生产版编译掉: EKF 在上位机做, 不需要这个帧。 */
#if EKF_ON_STM32
static void Send_OdomFrame(uart_port_t *p)
{
    uint8_t f[ODOM_FRAME_SIZE];
    uint8_t i;
    uint8_t bcc = 0;
    uint8_t flags = 0;
    int32_t x_mm = (int32_t)(ekf_x[0] * 1000.0f);
    int32_t y_mm = (int32_t)(ekf_x[1] * 1000.0f);
    int16_t head_cdeg = (int16_t)(ekf_x[2] * 57.29578f * 100.0f);   /* rad -> 0.01度 */

    if (ekf_ready)          flags |= 0x01;
    if (failsafe_latched)   flags |= 0x02;
    if (ever_linked)        flags |= 0x04;
    if (imu_ok)             flags |= 0x08;      /* IMU 最近一次读取成功 */

    f[0] = ODOM_HEAD;
    f[1] = flags;
    PutI32(&f[2], x_mm);
    PutI32(&f[6], y_mm);
    PutI16(&f[10], head_cdeg);
    PutI16(&f[12], (int16_t)(ekf_x[3] * 1000.0f));    /* 滤波后 vx  mm/s */
    PutI16(&f[14], (int16_t)(ekf_x[4] * 1000.0f));    /* 滤波后 wz  mrad/s */
    PutI16(&f[16], wheel_left_rpm);
    PutI16(&f[18], wheel_right_rpm);
    PutI16(&f[20], target_left_rpm);
    PutI16(&f[22], target_right_rpm);
    f[24] = m1_fault;
    f[25] = m2_fault;
    f[26] = can_error_count;
    f[27] = (uint8_t)(ports[PORT_MAIN].bad_count + ports[PORT_AUX].bad_count);
    f[28] = (uint8_t)(ports[PORT_MAIN].ok_count + ports[PORT_AUX].ok_count);
    f[29] = (uint8_t)(ports[PORT_MAIN].overflow + ports[PORT_AUX].overflow);
    f[30] = relay_state;                       /* bit0 电机 bit1 水泵 */
    f[31] = (ctrl_owner == OWNER_NONE) ? 0 : (uint8_t)(ctrl_owner + 1);
    f[32] = imu_status;                        /* YBIMU_ST_* 诊断结果 */
    f[33] = imu_found_addr;                    /* 扫描到的 I2C 器件地址, 0 = 没扫到 */
    for (i = 0; i < ODOM_FRAME_SIZE - 2; i++) bcc ^= f[i];
    f[ODOM_FRAME_SIZE - 2] = bcc;
    f[ODOM_FRAME_SIZE - 1] = ODOM_TAIL;

    for (i = 0; i < ODOM_FRAME_SIZE; i++) Port_SendByte(p, f[i]);
}
#endif /* EKF_ON_STM32 */

/*============================== main ===============================*/
int main(void)
{
    Tick_Init();
    CAN1_Init();
    USART1_Init();          /* PA9/PA10 -> CH340 / RK3588 */
#if !CHASSIS_RK3588_ONLY
    USART2_Init();          /* PA2/PA3  -> ESP32 (仅调试版) */
#endif
    Relay_Init();
#if EKF_ON_STM32
    Ekf_Init();
#endif
#if !CHASSIS_RK3588_ONLY
    ctrl_owner = OWNER_NONE;
#endif
    Delay_ms(200);

    target_vx = 0.0f;
    target_wz = 0.0f;
    /* 上电先刹住, 等上位机发命令 */
    CAN1_SendStop(MOTOR1_CAN_ID);
    CAN1_SendStop(MOTOR2_CAN_ID);

