SkyHao723/sweeper_chassis/firmware/stm32-chassis/user/main.c
    last_can_ms = g_tick_ms;
    last_odom_ms = g_tick_ms;
    last_tel_ms = g_tick_ms;
    last_cmd_ms = g_tick_ms;

    while (1)
    {
        Port_ProcessCommands(&ports[PORT_MAIN]);
#if !CHASSIS_RK3588_ONLY
        Port_ProcessCommands(&ports[PORT_AUX]);
#endif
        CAN1_Poll();

#if !CHASSIS_RK3588_ONLY
        /* 控制权超时 -> 释放, 让另一个口能接管 */
        if ((ctrl_owner != OWNER_NONE) &&
            ((g_tick_ms - ctrl_owner_ms) > OWNER_TIMEOUT_MS))
        {
            ctrl_owner = OWNER_NONE;
        }
#endif

        /* 看门狗: 上位机停发就自动停车。
           调试版里只认"当前控制方"的帧 —— 否则从口的心跳会把看门狗一直喂着,
           主口掉线了车也不会停。生产版只有一个上位机, 直接认它就是。 */
        if ((failsafe_latched == 0) &&
            (ever_linked) &&
            ((g_tick_ms - last_cmd_ms) > LINK_TIMEOUT_MS))
        {
            target_vx = 0.0f;
            target_wz = 0.0f;
            failsafe_latched = 1;
#if !CHASSIS_RK3588_ONLY
            ctrl_owner = OWNER_NONE;
#endif
#if RELAY_OFF_ON_LINK_LOSS
            Relay_Set(0);       /* 断线了顺便把电机/水泵继电器也断开 */
#endif
        }

        /* 轮速采样 + IMU + (可选)卡尔曼 */
        if ((g_tick_ms - last_odom_ms) >= ODOM_PERIOD_MS)
        {
            last_odom_ms = g_tick_ms;
            Odom_Tick();
        }

        /* 逆解 + CAN 下发 */
        if ((g_tick_ms - last_can_ms) >= CAN_PERIOD_MS)
        {
            last_can_ms = g_tick_ms;
            Drive_Apply();
        }

        /* 上报标准 24 字节帧 */
        if ((g_tick_ms - last_tel_ms) >= TELEMETRY_PERIOD_MS)
        {
            last_tel_ms = g_tick_ms;

            Send_MainTelemetry(&ports[PORT_MAIN]);
#if !CHASSIS_RK3588_ONLY
            Send_MainTelemetry(&ports[PORT_AUX]);
#endif

#if EKF_ON_STM32
            /* 位姿帧是本工程扩展, 厂商驱动不认识, 默认只发给调试口 */
            Send_OdomFrame(&ports[PORT_AUX]);
#if ODOM_FRAME_TO_MAIN
            Send_OdomFrame(&ports[PORT_MAIN]);
#endif
#endif
        }

        CAN1_Poll();
        Delay_ms(1);
    }
}
